src/Documents/Расписание/Расписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расписание</name>
  <registerRecords>AccumulationRegister.НагрузкаПреподавателей</registerRecords>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Занятия</name>
    <attributes>
      <name>Пара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗанятий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзJSON</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/НагрузкаПреподавателей/НагрузкаПреподавателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НагрузкаПреподавателей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Расписание/ObjectModule.bsl
#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Преподаватель) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не заполнен преподаватель";
		СообщениеПользователю.Поле = "Преподаватель";
		СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Месяц) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не заполнен месяц";
		СообщениеПользователю.Поле = "Месяц";
		СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НагрузкаПреподавателей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Преподаватель", Преподаватель);
	ЭлементБлокировки.УстановитьЗначение("Месяц", Месяц);
	Блокировка.Заблокировать();
	
	Движения.НагрузкаПреподавателей.Записывать = Истина;
	
	КоличествоПар = 0;
	Для Каждого Строка ИЗ Занятия Цикл
		
		Если НЕ Строка.ЗагруженИзJSON Тогда
			КоличествоПар = КоличествоПар + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	СуммаЧасов = КоличествоПар * 2;
	
	Если СуммаЧасов > 0 Тогда
		Движение = Движения.НагрузкаПреподавателей.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = Преподаватель;
		Движение.Месяц = Месяц;
		Движение.Часы = СуммаЧасов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
